[
    {
        "title": "The Girl in the Spider's Web  (Blu-ray English)",
        "price": "₹450",
        "description": "Young computer hacker Lisbeth Salander and journalist Mikael Blomkvist find themselves caught in a web of spies, cybercriminals and corrupt government officials."
    },
    {
        "title": "WUSHU  (DVD English)",
        "price": "₹199"
    },
    {
        "title": "Deadpool 1 & 2 - Theatrical Edition  (Blu-ray English)",
        "price": "₹1,290"
    },
    {
        "title": "Spider-Man: Far from Home (Blu-ray + Bonus Disc) (2-Disc)  (Blu-ray English)",
        "price": "₹750",
        "description": "Following the events of Avengers: Endgame, Peter Parker (TOM HOLLAND) returns in Spider-Man: Far From Home. Our friendly neighborhood Super Hero decides to join his best friends Ned, MJ, and the rest of the gang on a European vacation. However, Peter’s plan to leave super heroics behind for a few weeks is quickly scrapped when he begrudgingly agrees to help Nick Fury (SAMUEL L. JACKSON) uncover the mystery of several elemental creature attacks. Spider-Man and Mysterio (JAKE GYLLENHAAL) join forces to fight the havoc unleashed across the continent, but all is not as it seems."
    },
    {
        "title": "TITANIC (1953)+TITANIC (1997) DVD SET  (DVD English)",
        "price": "₹500",
        "description": "Titanic (1997): A seventeen-year-old aristocrat falls in love with a kind but poor artist aboard the luxurious, ill-fated R.M.S. Titanic. Titanic (1953): An unhappy married couple deal with their problems on board the ill-fated ship."
    },
    {
        "title": "Jurassic World: Fallen Kingdom  (Blu-ray English)",
        "price": "₹750",
        "description": "It’s been three years since theme park and luxury resort, Jurassic World was destroyed by dinosaurs out of containment. Isla Nublar now sits abandoned by humans while the surviving dinosaurs fend for themselves in the jungles. When the island’s dormant volcano begins roaring to life, Owen (Chris Pratt) and Claire (Bryce Dallas Howard) mount a campaign to rescue the remaining dinosaurs from this extinction-level event"
    },
    {
        "title": "Vikings: The Complete Series Collection (Uncut) (27-Disc Box Set Includes Slipcase Packaging) (Region Free | UK Import)  (Blu-ray English)",
        "price": "₹10,500",
        "description": "Journey to a thrilling ancient world in this epic series about history's bravest and most fearsome warriors! Ragnor, a would-be Viking cheiftan, longed to fulfill his destiny as an explorer and a conquerer, alongside his ambitious brother, shield maiden wife and warrior sons. But as Ragnor leads daring raids in distant realms across the ocean, treacherous forces in his Norse homeland conspire against him. Ragner must wage war on the battlefield and within himself to protect his freedom, family and life."
    },
    {
        "title": "GHULAM-E-MUSTHAFA  (DVD Hindi)",
        "price": "₹149"
    },
    {
        "title": "Alpha  (Blu-ray English)",
        "price": "₹450",
        "description": "A story of survival set 20,000 years ago during the last Ice Age."
    },
    {
        "title": "Rocketman  (Blu-ray English)",
        "price": "₹450",
        "description": "A musical fantasy about the fantastical human story of Elton John's breakthrough years."
    },
    {
        "title": "Fast & Furious 5: Fast Five  (Blu-ray English)",
        "price": "₹390",
        "description": "Get ready for “fi ve times the action, excitement and fun” (Shawn Edwards, FOX-TV) as Vin Diesel and Paul Walker lead a reunion of all-stars from every chapter of the explosive franchise built on speed in Fast &Furious Five. Fugitive Dominic Toretto (Diesel) partners with former cop Brian O’Conner (Walker) on the opposite side of the law in exotic Rio de Janeiro, Brazil. There they are hunted by a high-powered U.S. strike force led by its toughest Fed (Dwayne Johnson) and an army of corrupt cops working for a ruthless drug kingpin. To gain their freedom and win this ultimate high-stakes race, they must pull off one last job - an insane heist worth $100 million."
    },
    {
        "title": "xXx: Return Of Xander Cage (2017) (Fully Packaged Import)  (Blu-ray English)",
        "price": "₹1,599"
    },
    {
        "title": "Deadpool 2 + Super Duper Cut (Theatrical & Unrated) (4K UHD & HD) (Steelbook) (3-Disc)  (4K(UHD) Blu-ray English)",
        "price": "₹2,100",
        "description": "After losing Vanessa (Morena Baccarin), the love of his life, 4th-wall breaking mercenary Wade Wilson aka Deadpool (Ryan Reynolds) must assemble a team and protect a young, full-figured mutant Russell Collins aka Firefist (Julian Dennison) from Cable (Josh Brolin), a no-nonsense, dangerous cyborg from the future, and must also learn the most important lesson of all: to be part of a family again."
    },
    {
        "title": "Miss Peregrines Home for Peculiar Children  (Blu-ray English)",
        "price": "₹390",
        "description": "When Jacob discovers clues to a mystery that stretches across time, he finds Miss Peregrine's Home for Peculiar Children. But the danger deepens after he gets to know the residents and learns about their special powers."
    },
    {
        "title": "The Song (Region 3 | HK Import)  (DVD English)",
        "price": "₹1,199",
        "description": "Aspiring singer/songwriter Jed King is struggling to catch a break and escape the long shadow of his famous father when he reluctantly agrees to a gig at a local vineyard festival. Jed meets the owner’s daughter, Rose, and an instant connection quickly turns to love. Soon after their wedding, Jed writes Rose “The Song,” which becomes a breakout hit. Suddenly thrust into a life of stardom and a world of temptation, his life and marriage begin to fall apart. \n\nAdded Value: \n-Director’s Commentary\n-Meet the Cast\n-King Solomon on Screen: Adapting the Story\n-Author Kyle Idleman on Love, Sex & Marriage\n-Metaphors & Poetry: Themes of \"The Song\""
    },
    {
        "title": "A Good Day to Die Hard (Extended Edition) (Region B)  (Blu-ray English)",
        "price": "₹950"
    },
    {
        "title": "Hulk  (Blu-ray English)",
        "price": "₹1,199",
        "description": "Bruce Banner, a brilliant scientist with a cloudy past about his family, is involved in an accident in his laboratory causing him to become exposed to gamma radiation and Nanomeds (a tiny life form that is supposed to heal wounds, but has killed everything with which they have made contact). Confused and curious about his survival, Banner discovers that since the accident, whenever he becomes angry, he transforms into a giant green monster destroying everything in sight in an act of rage. Bruce's mysterious past and the answer to why the radiation had this effect becomes revealed to him as his birth father David Banner intervenes with hopes to continue experimenting on him."
    },
    {
        "title": "Tom & Jerry: Big Christmas Collection (10-Disc Box Set) (Region 2) (Slipcase Box + Fully Packaged Import)  (DVD English)",
        "price": "₹1,900"
    },
    {
        "title": "Mission: Impossible  (Blu-ray English)",
        "price": "₹990"
    },
    {
        "title": "Harry Potter: The Complete 8-Film Collection (All Harry Potter 8 Parts - Year 1 to 7) (8-Disc Box Set)  (DVD English)",
        "price": "₹4,500",
        "reviews": [
            "Best in the market!",
            "Awesome"
        ]
    },
    {
        "title": "Pacific Rim  (Blu-ray English)",
        "price": "₹590",
        "description": "When monstrous creatures, known as Kaiju, started rising from the sea, a war began that would take millions of lives and consume humanity's resources for years on end. To combat the giant Kaiju, a special type of weapon was devised: massive robots, called Jaegers, which are controlled simultaneously by two pilots whose minds are locked in a neural bridge. But even the Jaegers are proving nearly defenceless in the face of the relentless Kaiju. On the verge of defeat, the forces defending mankind have no choice but to turn to two unlikely heroes - a washed up former pilot (Charlie Hunnam) and an untested trainee (Rinko Kikuchi) - who are teamed to drive a legendary but seemingly obsolete Jaeger from the past. Together, they stand as mankind's last hope against the mounting apocalypse."
    },
    {
        "title": "Jumanji: Welcome To The Jungle (Blu-ray 3D) (1-Disc)  (3D Blu-ray English)",
        "price": "₹750"
    },
    {
        "title": "Terminator: Dark Fate  (DVD English)",
        "price": "₹500",
        "description": "A young female Mexican worker, Dani Ramos, is hunted down by a virtually indestructible terminator from the future called a REV-9. However, she is protected by an enhanced human named Grace who is also from the future. They flee from the unstoppable terminator and out of the blue Sarah Connor helps them on the road. All three head to Laredo, Texas, where Grace has the coordinates of a possible support and where they meet a T-800 who is living in an isolated location with his family. The group teams up to try to destroy the REV-9.",
        "reviews": [
            "Strictly for Terminator fans."
        ]
    },
    {
        "title": "Titanic (Only 3D Blu-ray) (2-Disc)  (3D Blu-ray English)",
        "price": "₹990"
    },
    {
        "title": "The Good, The Bad And The Ugly  (Blu-ray English)",
        "price": "₹850",
        "description": "A band of vigilantes catch Jed Cooper and, incorrectly believing him guilty of cattle rustling and murder, hang him and leave him for dead. But he doesn't die. He returns to his former profession of lawman to hunt down his lynchers and bring them to justice."
    },
    {
        "title": "Deadpool 2 + Super Duper Cut (Unrated) (4K UHD & HD) (3-Disc)  (4K(UHD) Blu-ray English)",
        "price": "₹2,299"
    },
    {
        "title": "Ben-Hur - 50th Anniversary Edition (2-Disc)  (Blu-ray English)",
        "price": "₹990"
    },
    {
        "title": "Titanic (1-Disc)  (Blu-ray English)",
        "price": "₹790"
    },
    {
        "title": "Annabelle (2014)  (Blu-ray English)",
        "price": "₹390",
        "description": "John Form has found the perfect gift for his expectant wife, Mia - a beautiful, rare vintage doll in a pure white wedding dress. But Mia's delight with Annabelle doesn't last long. On one horrific night, their home is invaded by members of a satanic cult, who violently attack the couple. Spilled blood and terror are not all they leave behind. The cultists have conjured an entity so malevolent that nothing they did will compare to the sinister conduit to the damned that is now... Annabelle."
    },
    {
        "title": "Titanic (2-Disc Edition)  (DVD English)",
        "price": "₹500",
        "description": "84 years later, a 100 year-old woman named Rose DeWitt Bukater tells the story to her granddaughter Lizzy Calvert, Brock Lovett, Lewis Bodine, Bobby Buell and Anatoly Mikailavich on the Keldysh about her life set in April 10th 1912, on a ship called Titanic when young Rose boards the departing ship with the upper-class passengers and her mother, Ruth DeWitt Bukater, and her fiancé, Caledon Hockley. Meanwhile, a drifter and artist named Jack Dawson and his best friend Fabrizio De Rossi win third-class tickets to the ship in a game. And she explains the whole story from departure until the death of Titanic on its first and last voyage April 15th, 1912 at 2:20 in the morning.",
        "reviews": [
            "Great product"
        ]
    },
    {
        "title": "007: Pierce Brosnan as James Bond - 4 Movies Collection - GoldenEye + Tomorrow Never Dies + The World is Not Enough + Die Another Day (4-Disc Box Set)  (Blu-ray English)",
        "price": "₹2,990",
        "reviews": [
            "Highly recommended"
        ]
    },
    {
        "title": "A Few Good Men  (Blu-ray English)",
        "price": "₹890"
    },
    {
        "title": "DHOONDTE REH JAOGE  (DVD Hindi)",
        "price": "₹149"
    },
    {
        "title": "Passengers  (Blu-ray English)",
        "price": "₹590",
        "description": "The spaceship, Starship Avalon, in its 120-year voyage to a distant colony planet known as the \"Homestead Colony\" and transporting 5,258 people has a malfunction in one of its sleep chambers. As a result one hibernation pod opens prematurely and the one person that awakes, Jim Preston (Chris Pratt) is stranded on the spaceship, still 90 years from his destination."
    },
    {
        "title": "Ant-Man  (Blu-ray English)",
        "price": "₹1,250",
        "reviews": [
            "Brilliant",
            "Awesome",
            "Mind-blowing purchase"
        ]
    },
    {
        "title": "Transformers 3: Dark of the Moon (Region Free) (Fully Packaged Import)  (Blu-ray English)",
        "price": "₹1,499",
        "description": "Autobots Bumblebee, Ratchet, Ironhide, Mirage (aka Dino), Wheeljack (aka Que) and Sideswipe led by Optimus Prime, are back in action taking on the evil Decepticons, who are eager to avenge their recent defeat. The Autobots and Decepticons become involved in a perilous space race between the United States and Russia to reach a hidden Cybertronian spacecraft on the moon and learn its secrets, and once again Sam Witwicky has to go to the aid of his robot friends. The new villain Shockwave is on the scene while the Autobots and Decepticons continue to battle it out on Earth."
    },
    {
        "title": "War Films 4 Movies Collection: Von Ryan's Express + Tora! Tora! Tora! + The Blue Max + Twelve O’clock High (4-Disc)  (Blu-ray English)",
        "price": "₹1,990"
    },
    {
        "title": "Fast & Furious 6  (Blu-ray English)",
        "price": "₹390",
        "description": "Vin Diesel, Paul Walker, Dwayne Johnson and Michelle Rodriguez lead an all-star cast as the global blockbuster franchise built on speed delivers the biggest adrenaline rush yet in Fast & Furious 6. Hobbs (Johnson) has been tracking an organization of lethally skilled drivers, whose mastermind (Luke Evans) is aided by the love Dom (Diesel) thought was dead, Letty (Rodriguez). The only way to stop the criminal mercenaries from stealing a top secret weapon is to outmatch them at street level, so Hobbs asks for the help of Dom and his elite team. Payment for the ultimate chase? Full pardons for all of them and a chance to make their families whole again.",
        "reviews": [
            "Classy product"
        ]
    },
    {
        "title": "Fast and Furious 4  (Blu-ray English)",
        "price": "₹390",
        "description": "Vin Diesel and Paul Walker team up again with Michelle Rodriguez and Jordana Brewster for the fourth chapter of the franchise built on speed! When fugitive Dominic Toretto (Diesel) returns to Los Angeles to avenge a loved one’s death, it reignites his feud with agent Brian O’Conner (Walker). However, they must soon test their loyalties by joining together to bring down a shared enemy. From big rig heists to precision tunnel crawls, Fast & Furious takes you back into the high-octane world to race through crowded city streets and across international lines!"
    },
    {
        "title": "Avatar (Blu-ray 3D & Blu-ray - Single Disc)  (3D Blu-ray English)",
        "price": "₹1,499",
        "reviews": [
            "Super!",
            "Mind-blowing purchase",
            "Worth every penny",
            "Super!",
            "Perfect product!",
            "Terrific",
            "Good purchase",
            "Best in the market!",
            "Best in the market!"
        ]
    }
]