[
    {
        "title": "Cinthol Original Soap, 100g (Pack of 8) | Germ Protection | Soaps For Bath | Grade 1 Soap | For All Skin Types",
        "price": "300.",
        "description": "About this item    CONTAINS: 8 units of Cinthol Original Bath Soap (100g each)    HIGH QUALITY: High TFM (Grade 1 soap) that keeps your skin healthy and glowing    DOCTOR RECOMMENDED: Recommended by doctors to reduce risk of skin problems by 95%    SKIN PROTECTION: Protects against sun, dust and pollution and helps prevent acne, blemishes and rashes    LASTING DEO FRAGRANCE: Long-lasting refreshing fragrance that keeps you fresh and confident all day    SUITABLE FOR: All skin types and all age groups; Ideal for both Men & Women    Available in 4 variants:Health+, Cool, Lime and Original",
        "reviews": [
            "Delivery and package was superb. Great product too.",
            "Nice",
            "Good",
            "Best for pimples free skin",
            "Suddenly price increase",
            "One of the best product from cintholHighly recommend",
            "OG",
            "It is very good in term of packing and interm of building quality is also solid it is strong & portable with smart feature"
        ]
    },
    {
        "title": "Godrej No.1 Lime & Aloe Vera Soap - Pack of 4 (150g each) - High TFM (Grade 1 Soap) | Soaps For Bath | Long-Lasting Fragrance",
        "price": "165.",
        "description": "About this item    Contains: 4 units of Godrej No. 1 Lime & Aloe Vera Bath Soap (150g each)    HIGH QUALITY: High TFM (Grade 1 soap) that keeps your skin healthy and glowing    CONTAINS NATURAL OILS: Gives you soft and beautiful skin    ALOE VERA: Moisturizes and nourishes the skin    LIME: helps to keep the skin fresh    LASTING FRAGRANCE: Long-lasting refreshing fragrance that keeps you fresh and confident all day    SUITABLE FOR: Bathing soap for all skin types and all age groups",
        "reviews": [
            "Product is good but package is not proper in my case",
            "Good",
            "good quality, afterall soap is soap",
            "Good",
            "Works ok",
            "okay product - standard.. no nothing much to add",
            "⭐⭐⭐⭐⭐ FOR FRAGRANCE.100% VALUE FOR MONEY.100% SATISFACTION GUARANTEED.",
            "Jambo size soap. Long lasting"
        ]
    }
]