[
    {
        "title": "Chandrika Ayurvedic Handmade soap for Clear and glowing skin 125g (Pack of 6)",
        "price": "231.",
        "description": "About this item    Quantity: 750g (Each 125g)    Item Form: Solid    It has more than double the amount of coconut oil and ayurvedic herbs, which gently treats skin problems and gives you clear, smooth and beautiful skin    Its a handmade soap enriched with the goodness of coconut oil with the other ayurvedic tailas like palmarosa oil, lemon peel oil, sandal wood oil, wild ginger oil, orange oil and patchouli oil    With regular use, Chandrika protects one from common skin problems like pimples, dark spots, rashes, pigmentation etc. The result clear blemish free skin, naturally!    Provides radiant glow and keeps your skin healthy. Keeps skin naturally soft, supple and gently perfumed    Skin Type: For All Skin Type    \n   Fragrance Scent: Floral Application Area: Body Usage: Lather and apply generously to the skin and then gently massage   Show More",
        "reviews": [
            "Quality is good",
            "It lists all the ingredients and most are natural. Not for very dry skinned people. I love it and the smell of natural herbs is awesome. Its a great alternative to brands like khadi which are quite expensive. Its better than margo and other natural ingredient soaps.",
            "It is not long-lasting...",
            "Got at good offer and the fragrance is ok",
            "Good product",
            "Good product",
            "Package and products are good",
            "There's only two types of comments people would feel after using this soap. They'll either like it totally or dislike it totally. I like it very much.Smell is not that good but almost everything else is good. Creamy, dependable cleaning.The only con? The soap breaks after two days of non-usage. That's not acceptable for two days of use and non-use. It's understandable when it's almost over. But a new soap? No, it should not crack.That said, it's such a relief to take bath with this soap. There's a feeling of freshness and vitality.",
            "This soap is good and feels good on skin too. The only reason I gave it 1 star less is because this seller's price is way too high compared to other sellers and sellers on e-bay for this same soap."
        ]
    },
    {
        "title": "Yardley London Gentleman Classic Activated Charcoal Soap, with 99.9% Germ Protection and Deep Cleansing of Skin - Pack Of 4 (100 g each)",
        "price": "210.",
        "description": "Enriched with the power of activated charcoal, the soap deeply cleanses the skin off impurities, dirt and oil    The triple milling process gives it a rich and creamy lather, and combined with the iconic gentleman classic fragrance, makes for a unique bathing experience leaving you fresh and fragrant    Introducing gentleman classic activated charcoal soap from the house of Yardley",
        "reviews": [
            "Cleans the skin really good and can see brightness for an hour. Deep cleans oil from skin, sometimes leaving dry skin. So use it mildly.Price is a little high, but worthy.",
            "The product is very good and the smell of the soap is also very good and good for men dry skin and the product is worth for the money",
            "I like it. Nice Scent.",
            "This soap feels great and gives fresh feeling with beautiful scent..",
            "Here are the pointsA) Scent: Standard Musk fragrance that you get in Cinthol and other brands. It's classic and good. One star for this.B) How the skin feels post usage: Dry. It doesn't leave the skin feeling normal, let alone supple. It feels dry. After 15 mins of taking a bath, you can feel the skin has hardened and even a smile on your face will cost your skin to break. This is not because of activated carbon. In fact this is a problem across Yardley soaps in general. So no stars for this.C) PH: It isn't neutral. In case this is important to you, look elsewhere. Nivea has a range but it's seldom available, expensive and quite feminine a scent. While I don't expect Cinthol to be PH neutral, it's natural to expect a higher standard from the house or Yardley. So again, no points for this.D) Long lasting soap bar: Looks like it will be fine. I hate typical Dove and Pears because they dilute as soon as water touches them. So this bar, should make it through. Again, this isn't going to last as long as lifebuoy. But 80% of the way. So one more star for this.E) delivery experience: delivered by Amazon on time, all the pieces came as promised. Manufactured in August 2022. 7 months ago, as of this review, but it should be OK. So one more star for this.That sums up the review. Hope it helps!",
            "It's shows quantity (pcs) of 4 in display but I have received 3 pcs.Feeling misguided.",
            "this soap for summer use for better ....",
            "worth the money even though it’s a bit high. everyone liked it. we used it before, got the same quality as earlier."
        ]
    }
]