[
    {
        "title": "Mabron Sup Game400 in 1 Super Handheld Game Console, Classic Retro Video Game, Colourful LCD Screen, Portable, Best for Kids [video game]",
        "price": "649.",
        "description": "About this item    Adapted AV Cable: Applicable to TV system, so that you can easily enjoy vivid and exciting games on a big screen.    Included: TV Output Cable, Charging USB Cable, Rechargeable Li-ion Battery 600mAh    Material:- ABS Plastic    Built-in 400 Classical Games: It's a good gift for your children, friends, both boys and girls will like it.    1 YEAR Replacement Warranty",
        "reviews": [
            "The games bring back the memories of the good old days.Sound quality is decent...battery quality is poor and so is the built quality [plastic body] I some time fear that if I drop it, then it might crack open...So the built could have been improved. Games are awesome as they were earlier...it was a good catch up at that price point...Worth the buy for playing experience...",
            "It was perfect for me when i was a kid but due to increased demand of smartphone and cyber security issues this is lone requirements for kids.",
            "Build plastic quality is poor"
        ]
    },
    {
        "title": "Gooyo GY-2521 Plug & Play 98000 Pre-loaded Games in 1 Handheld Remote Console | Outdoor & Indoor Electronic TV Games for Kids/Girls/Boys/Gifts/Adults | Black Color, Power Source: 3xAA Battery (Not Included)",
        "price": "599.",
        "description": "About this item    Easy to Install: Plug and play game, just connect to the TV, you can see the corresponding game page on the TV, and you can start playing the game. This game is suitable for TV/computer/monitor supports HDMI connection (non-AV output) and can enjoy lively and interesting video games on the big screen.    High-Quality Output: This wireless game console is suitable for 4K ultra-high-definition TV/computer/monitor/projector, supports HDMI connection (non-AV output), has high-definition picture quality, and can enjoy lively and interesting video games on the big screen.    Small and Convenient: The portable mini game console is light and compact. Plug and play, does not take up too much space, and is easy to carry, suitable for travel and family use. You can play anytime and anywhere.     Ergonomic Controllers: This game console includes one controller, which is ergonomically designed, and the streamlined lines fit the palm more closely, improving the comfort of the hand, even if you play games for a long time, the palm will not feel uncomfortable.    Superior Quality: 100% kid-friendly and made with the highest standards, This toy is expertly crafted using high-quality materials, ensures long-lasting durability and safe play for your child. It is crafted from premium quality plastic and with an ergonomic design for easy handling.     Best Gift for Kids: This game is the perfect holiday/ Christmas/ Thanksgiving/ Halloween/ birthday gift for men, boys, fathers, children, husbands and friends. Classic and interesting games can promote interaction and communication between you and your family and friends. Experience the happiness of growing up with your children.    Power Source: It requires 3xAA battery (not included). Flexible power supply will bring you a lot of joy and happiness during the trip or long journey.    \n\u009b See more product details",
        "reviews": [
            "Defective product delivered.Unfortunately the return period was over when I installed the item.I had to throw it in to dustbin.",
            "Not smoothly work"
        ]
    },
    {
        "title": "7 STREAM sup Game Box 400 in 1, SUP Handheld Game Console, Video Games Portable, Unique 400 in 1 FC Games, Mario Game, Super Mario, Mario Video Game Box for Kids Boys and Girls ( Assorted Color)",
        "price": "729.",
        "description": "About this item    400 Built-in Classic Games: Enjoy a treasure trove of 400 carefully selected retro games that defined the gaming industry. Relive the magic of timeless classics such as Super Mario Bros., Pac-Man, Contra, Tetris, Street Fighter, Sonic the Hedgehog, and much more.    User-Friendly Plug & Play: No complicated setup or additional accessories required! Simply plug the Sup Video Game Console into your TV via AV cables (included) and start gaming right away. It's the perfect way to bond with family and friends, creating unforgettable memories together.    High-Resolution Graphics: The Sup Video Game Console enhances your gaming experience with vibrant and sharp graphics. Relive the nostalgia of pixel-perfect visuals, bringing back memories of arcade gaming from yesteryears.    Portable and Lightweight: Designed with portability in mind, this compact console allows you to take your gaming fun on the go. Perfect for family road trips, vacations, or simply gaming with friends at a party.    Endless Entertainment: With 400 games at your disposal, you'll never run out of new challenges and experiences. Whether you're a seasoned gamer or new to the world of retro gaming, the Sup Video Game Console caters to players of all skill levels.    Quality and Durability: Crafted with high-quality materials, the Sup Video Game Console is built to withstand hours of gaming enjoyment without compromising on performance.    \n\u009b See more product details"
    },
    {
        "title": "(Kids Special) Video TV Game, LED Plug & Play Tv Video Game Console Childhood Game Dual Control 8-Bit Handheld Game Player for TV Video Games Maario Contra, Adventure Island, Duck Hunt, Road Fighter",
        "price": "1,599.",
        "description": "About this item    🎮[Collection Of 80's & 90's Games] - Super Marrios, Arcade Retro Games, Sports, Puzzles, Arcades, Shooting, Action, Racing, Fighting Games, Adventures, Like Contra, Tank Wars, Marios Etc. It Will Take You Back To Childhood And Experience Childhood Fun, this also helps your children keeping far from the mobile and makes your child very creative    🎮[Plug & Play Video Game Console]: Classic AV output game console, easy to install and connect. Just connect the game console to the TV through the attached AV cable, and you can enjoy every game with your family and friends. Please Make Sure Your Tv/Screen Has Av Input Ports. Just Plug & Play, No Need To Download Games Or Insert Cards. Simply Connect The Game Console To Tv Via Av Cable, Then Plug In The Controllers. Power On, Start Playing The Games    🎮[HELPS IN SKILLS DEVELOPMENT]: Games can help to improve cognitive skills such as problem-solving, critical thinking, and decision making. Thes games require players to think strategically and make quick decisions, which can enhance their cognitive abilities as there are multiple games such contras, Super Marrios and Bross and Etc.    🎮 [Perfect Christmas Or Birthday Gift] - Present For Boys, Girls, Men, Women. You May Also Purchase This Games Consoles For Your Friends, Your Kids, Your Husband, Your Wife, Anyone You Care About. The Perfect Companion To Enhance Our Child'S Eye Coordination. It Can Also Take You Back To Your Childhood. Gift For The Whole Family \"    🎮[Best family Activity for Kids]：This Classic New Multifunctional Mini Retro Game Console gives your children the chance to experience your growth and happiness, and promote the communication and feelings with your children. Let children enjoy the same happiness and fun in their childhood as you did! The retro games can also practice children's logical thinking and bring them confidence in game success.    \n\u009b See more product details"
    },
    {
        "title": "VGRASSP Handheld Portable Indoor and Outdoor Wisdome Video Game Compatible for Kids - Colour and Design as per Stock",
        "price": "236.",
        "description": "About this item    It's a good gift for your children, friends, both boys and girls will like it. So, that you can easily enjoy an exciting games.    The game can be paused and can be played next time without restarting. Improve your mental ability with this classic Wisdome game.    CROSS THE FIRE LINE SHOOTING BRICK And many other interesting Games    Easy to use: Just switch on and play. It provides better visual effects; ergonomic design, better grip and comfortable operation. One of the best gifts to give is also the best electronic product to pass your boring time.    It works on 2AA batteries (Not included).    \n\u009b See more product details",
        "reviews": [
            "When I switch on this product It is not working.... nothing is showing on screen , only music is working,  rest nothing is showing on this product display.  If you want to waster or through the money then , you can only buy this defective product.So bad experiences with this product . First amazon send notification that your product is canceled by you , I didn't cancel or reject it infact no one called me for the same , after I raised issue amazon delivered me this defective product. DO NOT BUY THIS PRODUCT . AMAZON SHOULD ALSO BLACLIST THESE TYPES OF SELLER ON HIS PLLATFORM",
            "It's a great hand game for kids..... instead of mobile we can make them use this...... durable n affordable...."
        ]
    },
    {
        "title": "VGRASSP Handheld Portable Indoor and Outdoor Brick Game 9999 in 1 Video Game Compatible for Kids - Colour and Design as per Stock",
        "price": "332.",
        "description": "About this item    It's a good gift for your children, friends, both boys and girls will like it. So, that you can easily enjoy an exciting games.    The game can be paused and can be played next time without restarting. Improve your mental ability with this classic brick game.    Press \"ROTATE\" to adjust the number at the top of the screen to select a game. 16 Falling speeds, 16 levels of height and 15 different patterns    Easy to use: Just switch on and play. The large 3.5-inch screen provides better visual effects; ergonomic design, better grip and comfortable operation. One of the best gifts to give is also the best electronic product to pass your boring time.    \n\u009b See more product details",
        "reviews": [
            "It will not work even a week very delicate and the button instructions erased in a  day after 5 games",
            "My son just love ❤️ this game . It has around 9999 games 🎮 in 1 . It is best for growing kids . It also has music 🎶 on and off option.  This game has different options to play ▶️.  It can also be played by adults and is best 👌 pasttime game 🎮 . It is very durable .",
            "Received brick game in blue instead red. Children do give importance to color. Also product quality is not upto the mark as per price. You can buy this same product twice from local store having same quality.",
            "Lasted just 2 days, poor quality. Better not as to waste money on this",
            "I gifted this product. Recipient tested it after few weeks. The product doesn't seems to work and we can't return it.",
            "Dont buy it",
            "Not working properly",
            "Just brought as a resolt of nostalgia. Good one loved playing"
        ]
    },
    {
        "title": "BHRAKUTI Brick Game 9999 in 1 Video Game Hand Operated Video Games for Kids Play, Birthday Return Gift, Portable Indoor and Outdoor Brick Game with Complementary Individual Gift Toy",
        "price": "497.",
        "description": "About this item    The large 3.5-inch screen provides better visual effects; ergonomic design, better grip and comfortable operation. One of the best gifts to give is also the best electronic product to pass your boring time.    Built-in 23 games: 01. Classic Brick game; 02-08. Other Brick game; 09. Tanks war; 10. Racing game; 11. Pinbal; 12. Shooting; 13. Obstacles Pinball; 14-15. Fill Shooting ;16-23.Various Reverse Brick game is classic, nostalgic, and puzzle. Each game can bring you happiness.    Press \"ROTATE\" to adjust the number at the top of the screen to select a game. The number \"01\" is a classic brick game. The speed of the game and the number of levels and difficulty can be adjusted. After selecting the game you want to play, press the right arrow key to adjust the speed before the game starts, press the left arrow key to adjust the difficulty level, and press the up/down key to adjust the level.    The game can be paused and can be played next time without restarting. Operation method: first press the \"S/P\" button to pause the game, then press the \"ON/OFF\" button to shut down, next time you play, first press the \"ON/OFF\" button to turn on, and then press the \"S/P\" button first Start the game.    Powered by 2*AA battery, 2 AA batteries can be used for 1 month (depending on the battery the quality of). Product weight/size: 90g/18*8*2CM; Product with packing box weight/size: 110g/18.7*8.3*2.7CM;",
        "reviews": [
            "ब्रिक हेंड गेम रिटर्न कीई थी ओ वापस नही मिली..",
            "Good product",
            "Low quality product. Got scratches all over and nothing like the old brick games",
            "Very worst product never ever I bought",
            "Material used is of not a good quality",
            "Don't buy... They are not even taking it back.",
            "Poor quality’s",
            "Too poor quality"
        ]
    },
    {
        "title": "meesa Sup 2 Player Video Game With Rechargeable Battery Handheld Colorful Lcd Screen Portable Game With Remote Control(For 2Nd Player Only ) With 400 In 1 Games With Famous Mario&Contra Game Included",
        "price": "679.",
        "description": "About this item    400 retro classic games - The game console built-in 400 classic games such as Red fortress, contra, Tank Wars, tetris, etc. Taking you back to your happy childhood    (Please note )product has 5 different color variety that is; Red, Black, Yellow, white and blue, so we ship Random color which is available in stock    3.0 Inches TFT Color Screen: High definition display, precise images transmission without delaying    Also connect to TV and play games, package contain 1 support game console only with accessory",
        "reviews": [
            "Had really hopes for this product, but received a problematic device. 1. Won't start or run unless all time connected to charger. 2. No sound, was really hoping for NES sounds in game but not a single beep heard from the device even after rotating the volume button. 3. Some games are way out of control where they select any thing run on their own and we can't do anything but watch. 4. Can't run standalone on battery hence not able to play or attach 2nd player so not sure will it work or not.",
            "1)Battery Backup Is Not More Than 20-30 min.2) 🎮 not working3) AV cable is very short",
            "                    The media could not be loaded.",
            "                ",
            " Value for money",
            "I have no word what I say I am so much happy and subscribe to pokey wisdom and fiya ailso all"
        ]
    },
    {
        "title": "[New 2023 Special for Kids] Edition Video Game for Kids, Handheld Sup 400 in 1 Mario, Super Marrio, Contra and Other 400 Games Console Video Game Box for Kids Both Boys and Girls \"",
        "price": "859.",
        "description": "About this item    Take this handheld game wherever you want. This console will mesmerize your child for long hours.    Take this handheld game anywhere you want to take it. This console will mesmerize your child for long hours.    Adapted AV cable: applicable to TV system, so that you can easily enjoy vivid and exciting games on a big screen    Built-in 400 classical games: it's a good gift for your children, friends, both boys and girls will like it    1 year replacment warranty    \n\u009b See more product details",
        "reviews": [
            "Nice video  games  🎮 🕹 👍 all games able nice game 🎮 👍 all so gud game my child  all be happy  😊",
            "Nice video game 🎯🎯🎮 all game nice ☺️ all be happy my child nice game gift 🎁🎁 be child happy nice video game 🎯🎯🎮🎮",
            "Nice video game my child all be happy always god 😅😅🙏🙏🙏 nice game all game able nice video game 😂😂"
        ]
    },
    {
        "title": "(Best for Kids) New Modern TV Video Game Console Classic Games, Built-in 620 Game Dual Control 8-Bit Plug & Plug and Play for Birthday Gifts Choice for Children/Adults Games Like Marios, Contra,",
        "price": "995.",
        "description": "About this item    🎮[620 Retro Games In 1 Console] -The Classic Mini Retro Game Console is very popular TV game console in the 1980's & 1990's. It has collected 620 classic games,which bring you to your childhood immediately. No need to pre-install the games and insert a card.Games includes many types, such as action, puzzles, sports, fighting and racing.It contains everything you need to have a perfect classic video game experience at home.You may not be used to it, but it's still so exciting    🎮[Best family Activity for Kids]：This Classic Retro Game Console gives your children the chance to experience your growth and happiness, and promote the communication and feelings with your children. Let children enjoy the same happiness and fun in their childhood as you did! The retro games can also practice children's logical thinking and bring them confidence in game success.    🎮[Plug & Play Video Game Console]: Classic AV output game console, easy to install and connect. Just connect the game console to the TV through the attached AV cable, and you can enjoy every game with your family and friends.    🎮[2.4G Wireless Dual Controllers]: This wireless retro game console with built in games comes with two 2.4G wireless controllers, no lag, no freeze. Support 1 or 2 people to play the game, the effective distance is 30 feet. Get rid of the restrictions of the connection line and play games freely!    🎮 [Wireless Retro handheld Game Console With Dual Remote] : This Wireless Retro Handheld Game Console With Built-In Games Comes To Support 4K Hd To Ensure That Your Tv Has Hd Input Interface, With 2 Pcs 2.4Ghz Wireless Game Controllers , Wireless Connection Between Game Controller And Game Console, No Line Limitation, More Interesting    🎮Av Out,Plug & Play This Retro Game System With Built In Games Is Av Output, Please Make Sure Your Tv/Screen Has Av Input Ports. Just Plug & Play, No Need To Download Games Or Insert Cards. Simply Connect The Game Console To Tv Via Av Cable, Then Plug In The Controllers. Power On, Start Playing The Games    🎮 [Perfect Christmas Or Birthday Gift] - Present For Boys, Girls, Men, Women. You May Also Purchase This Games Consoles For Your Friends, Your Kids, Your Husband, Your Wife, Anyone You Care About. The Perfect Companion To Enhance Our Child'S Eye Coordination. It Can Also Take You Back To Your Childhood. Gift For The Whole Family    🎮 Adapted AV Cable: compatible with TV systems, allowing you to play old-school video games on a large screen as well🎮 Adapted AV Cable: compatible with TV systems, allowing you to play old-school video games on a large screen as well    \n\u009b See more product details",
        "reviews": [
            "Very nice video game...loved it...very interesting .loved it...the experience was very good . intresting game awesome ... children love it"
        ]
    },
    {
        "title": "MADAV Plug & Play Video Game Set for Tv Gaming Console 2 Player Extreme Mini Game Box for Kids 8 Bit Video Game with Classic Inbuilt Game Super Mario Contra Double Dragon (Special Edition)",
        "price": "699.",
        "description": "About this item    This Wireless Retro Handheld Game Console With Built-In Games Comes To Support 4K Hd To Ensure That Your Tv Has Hd Input IGame Controllers , Wireless Connection Between Game Controller And Game Console, No Line Limitation, More Interesting    This Video Game Console Can Save Game Progress And Add New Games. Retro Game Stick Built-In 400+ Classic Games,Support Single-Player Two-Player Games,Mini Game Box Is Easy To Install, No Internet Required, Just By Connecting To The Tv You Can Play 400+ Classic Mini Video Game ,Let You Play Games Without Repetition Every Day And Bring Back Your Memory To The Fun Of Childhood,Enjoy Family Entertainment Time    \n\u009b See more product details",
        "reviews": [
            "Second controller for player # 2 does not work. pls. avoid."
        ]
    },
    {
        "title": "Viart Creation™ Plug & Play Video Game Box for Kids Wireless 64G Video Game for Kids 4k HD Classic Games Console 10K Games 9 Emulator Gaming Consoles HDMI Stick TV Video Game for Tv (Limited Edition)",
        "price": "2,899.",
        "description": "About this item    【Built-in 10000+ Retro Games】This wireless TV game console built in 10000+ rich games, is pre-install 9 emulators, and pack with 64GB TF card. No need to download and install by yourself, no internet required, you can play 10000+ classic games just by connecting to the TV. Let you play games every day and bring back your memory to the fun of childhood,enjoy family entertainment time.    【2.4GHz Wireless Controllers,Support 2 Players Play】This wireless retro handheld game console with built in games comes with 2 PCS 2.4GHz wireless game controllers, wireless connection between game controller and game stick, no road restrictions, more fun.    HDMI Output】Enjoy retro video game on a big TV screen by using the mini HDMI cable connect to the TV. This video game console support HDMI output ,please make sure your screen has an HDMI input port.    Easy operated】Just connect the game stick to the power source, then plug to the TV, and adjust the TV source to the HD channel to display the game list screen on the TV. The specific steps are as follows: 1. Connect the HD output of the TV first 2. Using the charging adapter to connect to the power will automatically turn on. (2 wireless controllers need to install 4 AAA batteries, not included in package)    [Massive Childhood Classic Games] Preloaded with 9 emulators(PS-1/ATARI/MAME/SFC/FC/GBA/GB/GBC/MD)and equipped with a 64GB TF card, this retro game console contains more than 10000 kinds of classic game. High-performance chip powerful operation ability,    Perfect Gift for Kids & Adults】 The handheld video game not only bringing funny game time to children but also waking up wonderful childhood memories to the 80s and 90s adults, as well as releasing their life pressure. Ideal gift for kids and adults on birthday or any occasion. Enjoy your parent-child time and it would be fun for the whole family.    Box contain-- 1 game stick with memory , 2 wireless controller , 1 usb cable , 1 hdmi converter , 1 usb dongle    \n\u009b See more product details",
        "reviews": [
            "Ps1 games slow as well as video quality very poor..cant playToo mang Repeated games with same names..not working , difficult to find orignal ones",
            "Game's are not workingLooks like used product",
            "                    The media could not be loaded.",
            "                ",
            " Perfect console for playing all childhood games..Cheers to makers..Thanks to Amazon for bringing it..Value for momey.Just loved it ..",
            "Nice video game console childhood game like contra super Mario Bros tekkan 3 Mustafa great quality great momories audio and video quality was super"
        ]
    },
    {
        "title": "Cable World Mid-Sized Foosball Mini Football Table Soccer Game, 51X31X10 cm 20 Inches for Kid",
        "price": "1,399.",
        "description": "About this item    Cable World Toys & Games Quick, easy assembly soccer game table, and score markers for each goal. Cable World    Cable World 360°rotated built-in soccer figures, 4 rows, 3 players each row, 2 rows for each team. Cable World    Cable World Suitable for indoor & outdoor, play in any place with a table or flat surface. Mini size, won't share too much space of your house and convenient storage. Cable World    Cable World Different color teams, easy to play, bring fun and attract children's interest in soccer. Cable World    Cable World Perfect gift for children, great entertainment equipment at home and parties. Cable World    \n\u009b See more product details",
        "reviews": [
            "Good game, the board and materials are also sturdy. But it bit bit difficult to assemble the board. No instructions found in box. I’m not sure why it was missed in my box. But you can contac seller or refer YouTube videos",
            "Broken edge",
            "It was a gift for 7 years old and she loved it. Good way to distract children from the mobile and other electronic devices.",
            "Nice to gift.. kids loved it",
            "Superb",
            "Ok",
            "Very interesting and fun to play with..sturdy and worth the price.",
            "Easy-to-use..wodden material.."
        ]
    },
    {
        "title": "VGRASSP Handheld Video Game Console, Retro Mini Game with 400 Classic Sup Game TV Compatible for Kids, Rechargeable 8 Bit Classic – Colour and Design as per Stock",
        "price": "702.",
        "description": "About this item    Built-in 400 Classical Games: It's a good gift for your children, friends, both boys and girls will like it. Adapted AV Cable: Applicable to TV system, so that you can easily enjoy vivid and exciting games on a big screen.    Perfect gift for children, retro game lovers, collectors, etc    Play Longer: 600 mAh rechargeable lithium battery, supports up to 3-4 hours of continuous game play    Easy to use: Just switch on and play. Cable to connect with TV included.    \n\u009b See more product details",
        "reviews": [
            "It's good and it's does what it says. But I find it too small. I gave this to my son but fear that it would effect his eyes",
            "My kids would have had more fun with atleast 2 mire hours of battery life. Full charge gives 1 hour of play time",
            "Battery no long life... Within half an hour.. Full off.. Also& others good.. .!",
            "Good device.",
            "Bad quality",
            "Good old memories",
            "                    The media could not be loaded.",
            "                ",
            " Overall Product is nice but it consumes lots of battery drained."
        ]
    },
    {
        "title": "Madhav Video Games for Kids 64G Video Game for Kids 4k HD Classic Games Console Built in 10000 Game in TF Card, 9 Emulator Console, HDMI Output TV Video Game Console Black Kids Edition New",
        "price": "2,999.",
        "description": "About this item    2.4GHz Wireless Controllers, Support Two-Player Games:Equipped with two 2.4G wireless joysticks, Sensitive without delay, get rid of the shackles of the thread.the connection distance of the controller is 8-10 meters,Plug and play, comfortable feel, you can better Enjoy the fun of classic nostalgic games with family or friends.    Upgrated -Smart Game Chip: wireless TV game console built-in more than 10000 Games,more than 9 Emulators are installed , and a 64GBTF card is attached which support you to game search functions, and can save/read game records.Use upgraded game chips to support 8-bit, 16-bit, 32-bit, 64-bit, 128-bit emulators. It perfectly meets your needs for image quality and game fluency.    HDMI Output:This video game console supports HDMI connection ,Please make sure your screen has an HDMI input port.it has 1080P HD image quality, and can enjoy lively and interesting video games on the big screen.    Light and Easy to Carry:The protable mini game console has lightweight and compact body. Only 102mm long, 30 grams weight. does not take up space, and is easy to carry.special game rocker for arcade ,high sensitivity andantiskid design, comfortable feel, you can better share your fun with family or friends.    \n\u009b See more product details",
        "reviews": [
            "The product is very good for retro game like mario contra, no lag, joy stick remote running smoothly in any game, Perfect kit for 90s game, past memories now refreshing feeling overwhelmed 🥰Go ahead and must Buy"
        ]
    },
    {
        "title": "New Advance Handheld Video Gamen with HD Screen Console, Retro Mini Game with 400 Classic Sup Game TV Compatible for Kids, Rechargeable 8 Bit Classic – Colour and Design as per Stock",
        "price": "979.",
        "description": "About this item    🎮[400 Games Retro Games In 1 SUP Console] - Mario, Arcade Retro Games, Sports, Puzzles, Arcades, Shooting, Action, Racing, Fighting Games, Adventures, Like Contra, Tank Wars, Mario Etc. It Will Take You Back To Childhood And Experience Childhood Fun, this also helps your children keeping far from the mobile and makes your child very creative    🎮 [Best Game For Handheld] - Compact And Easy To Carry, 150G Lightweight, Can Be With You In Your Pocket, Bag, Etc. It Perfect For Traveling Or On The Go. There Is A Protective Film On The Screen, You May Pill It Off When You Get The Game Console with Tightening To Make This New For Always    🎮[Best family Activity for Kids]：This Classic SUP Mini Retro Game Console gives your children the chance to experience your growth and happiness, and promote the communication and feelings with your children. Let children enjoy the same happiness and fun in their childhood as you did! The retro games can also practice children's logical thinking and bring them confidence in game success.    🎮[Best Gift For Children]:game console is a perfect festival/ christmas/ thanksgiving/ birthday gift for men, boy, dad, kids, husband and friends. as this will remind them 90's best game such as Contra, Mario and etc.    🎮[USB RECHARGEABLE] -- Built-in 1020 mAh lithium battery,come with a rechargeable lithium battery and a USB cable , charging time is about 1.5 hours,4 hours of continuous game play    \n\u009b See more product details",
        "reviews": [
            "Very nice game"
        ]
    },
    {
        "title": "(Kids Special Deal) 2023 New Edition Video Game for Kids, Handheld Sup 400 in 1 Mario, Super Marrio, Contra and Other 400 Games Console Video Game Box for Kids \" (Special Edition) (Classic Edition)",
        "price": "995.",
        "description": "About this item    🎮[400 Games Retro Games In 1 SUP Console] - Mario, Arcade Retro Games, Sports, Puzzles, Arcades, Shooting, Action, Racing, Fighting Games, Adventures, Like Contra, Tank Wars, Mario Etc. It Will Take You Back To Childhood And Experience Childhood Fun, this also helps your children keeping far from the mobile and makes your child very creative    🎮 [Best Game For Handheld] - Compact And Easy To Carry, 150G Lightweight, Can Be With You In Your Pocket, Bag, Etc. It Perfect For Traveling Or On The Go. There Is A Protective Film On The Screen, You May Pill It Off When You Get The Game Console with Tightening To Make This New For Always    🎮[Best family Activity for Kids]：This Classic SUP Mini Retro Game Console gives your children the chance to experience your growth and happiness, and promote the communication and feelings with your children. Let children enjoy the same happiness and fun in their childhood as you did! The retro games can also practice children's logical thinking and bring them confidence in game success.    🎮[Best Gift For Children]:game console is a perfect festival/ christmas/ thanksgiving/ birthday gift for men, boy, dad, kids, husband and friends. as this will remind them 90's best game such as Contra, Mario and etc.    🎮[USB RECHARGEABLE] -- Built-in 1020 mAh lithium battery,come with a rechargeable lithium battery and a USB cable , charging time is about 1.5 hours,4 hours of continuous game play    🎮 [Perfect Christmas Or Birthday Gift] - Present For Boys, Girls, Men, Women. You May Also Purchase This Games Consoles For Your Friends, Your Kids, Your Husband, Your Wife, Anyone You Care About. The Perfect Companion To Enhance Our Child'S Eye Coordination. It Can Also Take You Back To Your Childhood. Gift For The Whole Family    🎮 Adapted AV Cable: compatible with TV systems, allowing you to play old-school video games on a large screen as well    \n\u009b See more product details",
        "reviews": [
            "AV cable and usb cable length very less. Everything else good",
            "Not good to have it. I bought two for my both kids but Within two days display goes blank. Tv input wire in very bad condition. I requested for replacement but no action. Worst experience"
        ]
    }
]